{"COCO_val2014_000000391895.jpg": ["A man with a red helmet on a small moped on a dirt road. "], "COCO_val2014_000000522418.jpg": ["Man riding a motor bike on a dirt road on the countryside."], "COCO_val2014_000000184613.jpg": ["A man riding on the back of a motorcycle."], "COCO_val2014_000000318219.jpg": ["A dirt path with a young person on a motor bike rests to the foreground of a verdant area with a bridge and a background of cloud-wreathed mountains. "], "COCO_val2014_000000554625.jpg": ["A man in a red shirt and a red hat is on a motorcycle on a hill side."], "COCO_val2014_000000397133.jpg": ["A woman wearing a net on her head cutting a cake. "], "COCO_val2014_000000574769.jpg": ["A woman cutting a large white sheet cake."], "COCO_val2014_000000060623.jpg": ["A woman wearing a hair net cutting a large sheet cake."], "COCO_val2014_000000309022.jpg": ["there is a woman that is cutting a white cake"], "COCO_val2014_000000005802.jpg": ["A woman marking a cake with the back of a chef's knife. "], "COCO_val2014_000000222564.jpg": ["A child holding a flowered umbrella and petting a yak."], "COCO_val2014_000000118113.jpg": ["A young man holding an umbrella next to a herd of cattle."], "COCO_val2014_000000193271.jpg": ["a young boy barefoot holding an umbrella touching the horn of a cow"], "COCO_val2014_000000224736.jpg": ["A young boy with an umbrella who is touching the horn of a cow."], "COCO_val2014_000000483108.jpg": ["A boy holding an umbrella while standing next to livestock."], "COCO_val2014_000000403013.jpg": ["A young boy standing in front of a computer keyboard."], "COCO_val2014_000000374628.jpg": ["a little boy wearing headphones and looking at a computer monitor"], "COCO_val2014_000000328757.jpg": ["He is listening intently to the computer at school."], "COCO_val2014_000000384213.jpg": ["A young boy stares up at the computer monitor."], "COCO_val2014_000000293802.jpg": ["a young kid with head phones on using a computer "], "COCO_val2014_000000086408.jpg": ["a boy wearing headphones using one computer in a long row of computers"], "COCO_val2014_000000037777.jpg": ["A little boy with earphones on listening to something."], "COCO_val2014_000000372938.jpg": ["A group of people sitting at desk using computers."], "COCO_val2014_000000386164.jpg": ["Children sitting at computer stations on a long table."], "COCO_val2014_000000223648.jpg": ["A small child wearing headphones plays on the computer."], "COCO_val2014_000000204805.jpg": ["A man is in a kitchen making pizzas."], "COCO_val2014_000000113588.jpg": ["Man in apron standing on front of oven with pans and bakeware"], "COCO_val2014_000000384553.jpg": ["A baker is working in the kitchen rolling dough."], "COCO_val2014_000000337264.jpg": ["A person standing by a stove in a kitchen."], "COCO_val2014_000000368402.jpg": ["A table with pies being made and a person standing near a wall with pots and pans hanging on the wall."], "COCO_val2014_000000012448.jpg": ["A woman in a room with a cat."], "COCO_val2014_000000252219.jpg": ["A girl smiles as she holds a cat and wears a brightly colored skirt."], "COCO_val2014_000000079841.jpg": ["a woman is holding a cat in her kitchen"], "COCO_val2014_000000087038.jpg": ["A woman is working in a kitchen carrying a soft toy."], "COCO_val2014_000000174482.jpg": ["A woman is holding a cat in her kitchen."], "COCO_val2014_000000515289.jpg": ["A young girl inhales with the intent of blowing out a candle. "], "COCO_val2014_000000562150.jpg": ["A young girl is preparing to blow out her candle."], "COCO_val2014_000000542145.jpg": ["A kid is to blow out the single candle in a bowl of birthday goodness. "], "COCO_val2014_000000412151.jpg": ["Girl blowing out the candle on an ice-cream "], "COCO_val2014_000000403385.jpg": ["A little girl is getting ready to blow out a candle on a small dessert."], "COCO_val2014_000000579003.jpg": ["A commercial stainless kitchen with a pot of food cooking. "], "COCO_val2014_000000540186.jpg": ["Some food sits in a pot in a kitchen. "], "COCO_val2014_000000242611.jpg": ["A kitchen has all stainless steel appliances and counters."], "COCO_val2014_000000051191.jpg": ["a kitchen with a sink and many cooking machines and a pot of food"], "COCO_val2014_000000269105.jpg": ["Food cooks in a pot on a stove in a kitchen."], "COCO_val2014_000000294832.jpg": ["Two men wearing aprons working in a commercial-style kitchen."], "COCO_val2014_000000462565.jpg": ["Chefs preparing food in a professional metallic style kitchen."], "COCO_val2014_000000144941.jpg": ["Two people standing around in a large kitchen."], "COCO_val2014_000000173350.jpg": ["A commercial kitchen with two men working to prepare several plates."], "COCO_val2014_000000060760.jpg": ["two men in white shirts in a large steel kitchen"], "COCO_val2014_000000324266.jpg": ["Two chefs in a restaurant kitchen preparing food. "], "COCO_val2014_000000166532.jpg": ["Two cooks are cooking the food someone ordered at this restaurant"], "COCO_val2014_000000262284.jpg": ["The chef is cooking with pans on the stove next to an oven. "], "COCO_val2014_000000360772.jpg": ["Two men that are standing in a kitchen."], "COCO_val2014_000000006818.jpg": ["Two cooks are near the stove in a stainless steel kitchen."], "COCO_val2014_000000191381.jpg": ["this is a very dark picture of a room with a shelf"], "COCO_val2014_000000111076.jpg": ["a cluttered room with a table and shelf on the wall."], "COCO_val2014_000000340559.jpg": ["A view of a messy room, with shelves on the wall."], "COCO_val2014_000000258985.jpg": ["A dark and cluttered storage area with wood walls."], "COCO_val2014_000000509822.jpg": ["A dim lit room consisting of many objects put together. "], "COCO_val2014_000000321107.jpg": ["A kitchen filled with black appliances and lots of counter top space."], "COCO_val2014_000000229643.jpg": ["some brown cabinets a black oven a tea kettle and a microwave"], "COCO_val2014_000000125059.jpg": ["A small kitchen with glass and wooden cabinets."], "COCO_val2014_000000455483.jpg": ["A modern style kitchen filled with may different items."], "COCO_val2014_000000436141.jpg": ["A kitchen with wooden cabinets and black appliances."], "COCO_val2014_000000129001.jpg": ["A professional kitchen filled with sinks and appliances."], "COCO_val2014_000000232262.jpg": ["A kitchen area with toilet and various cleaning appliances."], "COCO_val2014_000000061181.jpg": ["A commercial dish washing station with a toilet in it."], "COCO_val2014_000000166323.jpg": ["A toilet and mop bucket in a kitchen."], "COCO_val2014_000000580041.jpg": ["A cluttered room with a sink, a toilet and in industrial mop bucket."], "COCO_val2014_000000326781.jpg": ["A man on a bicycle riding next to a train"], "COCO_val2014_000000387362.jpg": ["A person is riding a bicycle but there is a train in the background."], "COCO_val2014_000000138079.jpg": ["a red and white train and a man riding a bicycle"], "COCO_val2014_000000556616.jpg": ["a guy that is riding his bike next to a train"], "COCO_val2014_000000472621.jpg": ["A man riding a bike past a train traveling along tracks."], "COCO_val2014_000000192440.jpg": ["A narrow kitchen filled with appliances and cooking utensils."], "COCO_val2014_000000086320.jpg": ["A galley kitchen with cabinets and appliances on both sides"], "COCO_val2014_000000256668.jpg": ["A hallway leading into a white kitchen with appliances."], "COCO_val2014_000000383445.jpg": ["Doorway view of a kitchen with a sink, stove, refrigerator and pantry."], "COCO_val2014_000000565797.jpg": ["The pantry door of the small kitchen is closed."], "COCO_val2014_000000081922.jpg": ["A kitchen with wood floors and lots of furniture."], "COCO_val2014_000000050125.jpg": ["A beautiful, open kitchen and dining room area features an island in the center and wood cabinets and large windows."], "COCO_val2014_000000364521.jpg": ["A kitchen made of mostly wood with a small desk with a laptop."], "COCO_val2014_000000394892.jpg": ["A very spacious room with a kitchen and dining area."], "COCO_val2014_000000001146.jpg": ["A full view of an open kitchen and dining area."], "COCO_val2014_000000310391.jpg": ["A woman eating vegetables in front of a stove."], "COCO_val2014_000000097434.jpg": ["A woman forks vegetables out of a bowl into her mouth. "], "COCO_val2014_000000463836.jpg": ["Woman eating an assortment of mixed vegetables in a bowl."], "COCO_val2014_000000241876.jpg": ["A young woman standing in a kitchen eats a plate of vegetables."], "COCO_val2014_000000156832.jpg": ["A woman eating fresh vegetables from a bowl."], "COCO_val2014_000000480985.jpg": ["A kitchen is shown with a variety of items on the counters."], "COCO_val2014_000000458054.jpg": ["A kitchen has the windows open and plaid curtains."], "COCO_val2014_000000270721.jpg": ["A kitchen with two windows and two metal sinks."], "COCO_val2014_000000462341.jpg": ["An older kitchen with cluttered counter tops but empty sink."], "COCO_val2014_000000310103.jpg": ["Glasses and bottles are placed near a kitchen sink."], "COCO_val2014_000000032992.jpg": ["A boy performing a kickflip on his skateboard on a city street."], "COCO_val2014_000000122851.jpg": ["A man is doing a trick on a skateboard"], "COCO_val2014_000000540763.jpg": ["A guy jumps in the air with his skateboard beneath him."], "COCO_val2014_000000331352.jpg": ["Man in all black doing a trick on his skateboard."], "COCO_val2014_000000138246.jpg": ["A skateboarder flipping his board on a street."], "COCO_val2014_000000197254.jpg": ["A kitchen with a stove, microwave and refrigerator."], "COCO_val2014_000000032907.jpg": ["A refrigerator, oven and microwave sitting in a kitchen."], "COCO_val2014_000000251252.jpg": ["The kitchenette uses  small space to great efficiency."], "COCO_val2014_000000037675.jpg": ["an image of a kitchen setting with black appliances"], "COCO_val2014_000000159537.jpg": ["A kitchen with cabinets, a stove, microwave and refrigerator."], "COCO_val2014_000000268556.jpg": ["The dining table near the kitchen has a bowl of fruit on it."], "COCO_val2014_000000271177.jpg": ["A small kitchen has various appliances and a table."], "COCO_val2014_000000075051.jpg": ["The kitchen is clean and ready for us to see."], "COCO_val2014_000000549399.jpg": ["A kitchen and dining area decorated in white."], "COCO_val2014_000000085160.jpg": ["A kitchen that has a bowl of fruit on the table."], "COCO_val2014_000000559665.jpg": ["A group of people riding on the back of a loaded red pickup truck."], "COCO_val2014_000000296649.jpg": ["A truck with a number of people and things in the back"], "COCO_val2014_000000019358.jpg": ["Men are crowded on the back of a small overloaded pickup truck."], "COCO_val2014_000000459912.jpg": ["An old pick up truck over loaded with people and cargo."], "COCO_val2014_000000015827.jpg": ["A truck carries a large amount of items and a few people."], "COCO_val2014_000000394240.jpg": ["A wooden ball on top of a wooden stick."], "COCO_val2014_000000510755.jpg": ["The table is full of wooden spoons and utensils."], "COCO_val2014_000000175831.jpg": ["A wood table holding an assortment of wood cooking utensils."], "COCO_val2014_000000386912.jpg": ["A selection of wooden kitchen tools on a counter."], "COCO_val2014_000000079472.jpg": ["Wooden spoons are lined up on a table"], "COCO_val2014_000000502136.jpg": ["Multiple wooden spoons are shown on a table top."], "COCO_val2014_000000250108.jpg": ["A table surrounded by chairs and filled with cooking utensils."], "COCO_val2014_000000491497.jpg": ["Wooden spoons laid out across a kitchen table."], "COCO_val2014_000000315601.jpg": ["Wooden spoons and forks are all over a table."], "COCO_val2014_000000437218.jpg": ["A table and chairs with wooden kitchen tools on top."], "COCO_val2014_000000503707.jpg": ["A large boat filled with mean on wheels."], "COCO_val2014_000000184791.jpg": ["A bunch of people aboard a boat with wheels. "], "COCO_val2014_000000074331.jpg": ["A boat is being rolled on a trailer"], "COCO_val2014_000000579664.jpg": ["A large boat full of men is sitting on a cart "], "COCO_val2014_000000369763.jpg": ["A boat full of people is on a trailer with wheels."], "COCO_val2014_000000199951.jpg": ["several young students working at a desk with multiple computers"], "COCO_val2014_000000452684.jpg": ["A young man at his workstation examines the monitor of a lap top, with one hand on the keyboard and the other on the mouse."], "COCO_val2014_000000213687.jpg": ["A man is working on a laptop next to other computers."], "COCO_val2014_000000108094.jpg": ["People in a large room, use multiple computers."], "COCO_val2014_000000527040.jpg": ["A young professional is working at his laptop while his coworker is reading material."], "COCO_val2014_000000350341.jpg": ["A man riding an elephant into some water of a creek."], "COCO_val2014_000000550529.jpg": ["man riding an elephant into water surrounded by forest"], "COCO_val2014_000000432176.jpg": ["A man riding an elephant in a river."], "COCO_val2014_000000281533.jpg": ["A man in a brown shirt rides an elephant into the water."], "COCO_val2014_000000369826.jpg": ["A man rides an elephant into a river."], "COCO_val2014_000000551334.jpg": ["a couple of women  are in a kitchen"], "COCO_val2014_000000291380.jpg": ["Two people standing in the kitchen of a home."], "COCO_val2014_000000368978.jpg": ["A group of people who are around a kitchen counter."], "COCO_val2014_000000077123.jpg": ["A group of people prepare dinner in the kitchen."], "COCO_val2014_000000513681.jpg": ["two women in a kitchen bottles and lights"], "COCO_val2014_000000348881.jpg": ["The woman in the kitchen is holding a huge pan."], "COCO_val2014_000000437370.jpg": ["A chef carrying a large pan inside of a kitchen."], "COCO_val2014_000000078371.jpg": ["A woman is holding a large pan in a kitchen. "], "COCO_val2014_000000560623.jpg": ["A woman cooking in a kitchen with granite counters."], "COCO_val2014_000000289173.jpg": ["A woman cooking in her kitchen with a black pan."], "COCO_val2014_000000052759.jpg": ["A baby is laying down with a teddy bear."], "COCO_val2014_000000289393.jpg": ["A baby laying in a crib with a stuffed teddy bear."], "COCO_val2014_000000568623.jpg": ["A baby wearing gloves, lying next to a teddy bear"], "COCO_val2014_000000128939.jpg": ["A baby stares to the left while taking a picture with a teddy bear lays beside it ."], "COCO_val2014_000000339974.jpg": ["A baby lies on blue and green bedding next to a teddy bear."], "COCO_val2014_000000561100.jpg": ["a person with a shopping cart on a city street "], "COCO_val2014_000000150410.jpg": ["City dwellers walk by as a homeless man begs for cash."], "COCO_val2014_000000009426.jpg": ["People walking past a homeless man begging on a city street"], "COCO_val2014_000000014869.jpg": ["a homeless man holding a cup and standing next to a shopping cart on a street"], "COCO_val2014_000000522713.jpg": ["People are walking on the street by a homeless person."], "COCO_val2014_000000281221.jpg": ["Two bikers, one in front of a building, the other in the city."], "COCO_val2014_000000108169.jpg": ["Two shots of men riding bicycles down city streets."], "COCO_val2014_000000440575.jpg": ["A man riding a bike in front of a tall building."], "COCO_val2014_000000354533.jpg": ["There are two different people riding bikes down the street."], "COCO_val2014_000000181666.jpg": ["Two photos of a person riding a bicycle on the side of the road."], "COCO_val2014_000000545959.jpg": ["A person on a skateboard and bike at a skate park."], "COCO_val2014_000000511058.jpg": ["A man on a skateboard performs a trick at the skate park"], "COCO_val2014_000000091227.jpg": ["A skateboarder jumps into the air as he performs a skateboard trick."], "COCO_val2014_000000242139.jpg": ["Athletes performing tricks on a BMX bicycle and a skateboard."], "COCO_val2014_000000017627.jpg": ["a man falls off his skateboard in a skate park."], "COCO_val2014_000000334321.jpg": ["a blue bike parked on a side walk "], "COCO_val2014_000000381021.jpg": ["A bicycle is chained to a fixture on a city street"], "COCO_val2014_000000170629.jpg": ["A blue bicycle sits on a sidewalk near a street."], "COCO_val2014_000000143931.jpg": ["A bicycle is locked up to a post"], "COCO_val2014_000000303818.jpg": ["a bike sits parked next to a street "], "COCO_val2014_000000207797.jpg": ["People riding bicycles down the road approaching a bird."], "COCO_val2014_000000179558.jpg": ["three bicycle riders some trees and a pigeon"], "COCO_val2014_000000368117.jpg": ["A geoup of people on bicycles coming down a street."], "COCO_val2014_000000015085.jpg": ["Several smiling bicycle riders approaching a colorful pigeon."], "COCO_val2014_000000467522.jpg": ["A pigeon greets three bicyclists on a park path"], "COCO_val2014_000000040102.jpg": ["A little girl holding a kitten next to a blue fence."], "COCO_val2014_000000403020.jpg": ["Girl in a tank top holding a kitten in her back yard"], "COCO_val2014_000000006005.jpg": ["A young girl is holding a small cat."], "COCO_val2014_000000219514.jpg": ["Girl with a yellow shirt holding a small cat"], "COCO_val2014_000000521634.jpg": ["A girl smiles as she holds a kitty cat."], "COCO_val2014_000000125476.jpg": ["A toilet and a sink in small bathroom."], "COCO_val2014_000000402559.jpg": ["a bathroom with just a toliet and a sink in it"], "COCO_val2014_000000484816.jpg": ["A small section of a bathroom with dim lighting."], "COCO_val2014_000000165547.jpg": ["a bathroom with a toilet, sink, cabinet and mirror"], "COCO_val2014_000000463730.jpg": ["The bathroom has been cleaned and is ready to use. "], "COCO_val2014_000000081561.jpg": ["A bicycle store shows two males leaning toward a bike."], "COCO_val2014_000000227125.jpg": ["A man adjust a bicycle in a bike shop with a child."], "COCO_val2014_000000189550.jpg": ["The bike shop employee is helping a customer. "], "COCO_val2014_000000212663.jpg": ["A man and a boy are talking about a bicycle in a store."], "COCO_val2014_000000476005.jpg": ["Two people in a shop looking at a bike."], "COCO_val2014_000000505440.jpg": ["A bathroom that has a broken wall in the shower."], "COCO_val2014_000000067868.jpg": ["A bathroom looks clean but is missing tile at the shower stall."], "COCO_val2014_000000450263.jpg": ["A view of a bathroom that needs to be fixed up."], "COCO_val2014_000000241691.jpg": ["a shower toilet and sink in a basement bathroom"], "COCO_val2014_000000450500.jpg": ["A very big whit rest room with a shabby looking shower."], "COCO_val2014_000000545293.jpg": ["A shower stall with interesting tile is the focal point."], "COCO_val2014_000000232894.jpg": ["A full perspective of a washroom with a sink. \n"], "COCO_val2014_000000439969.jpg": ["A white bathroom sink sitting under a mirror."], "COCO_val2014_000000029913.jpg": ["I picture of a bathroom with a stand up shower stall and a person's reflection in the mirror."], "COCO_val2014_000000410437.jpg": ["A small shower behind a small bathroom sink."], "COCO_val2014_000000455859.jpg": ["A view of a very large bathroom with mirrored walls."], "COCO_val2014_000000235302.jpg": ["a corner bathroom with two sinks and a bathtub"], "COCO_val2014_000000431573.jpg": ["A bathroom with a sink, shower and bathtub."], "COCO_val2014_000000290570.jpg": ["A large bathroom with cabinets, mirrors and a tub."], "COCO_val2014_000000127474.jpg": ["This bathroom has mirrors on the doors, cabinets, and a bathtub in the corner."], "COCO_val2014_000000028758.jpg": ["a long beige bathroom with a door to a bedroom and another to the hallway"], "COCO_val2014_000000163020.jpg": ["A view of a bathroom with double sinks and carpeted floor."], "COCO_val2014_000000332654.jpg": ["white vanity that opens up to a bathroom with shower"], "COCO_val2014_000000281455.jpg": ["a hallway with diamond patterned walls leading to a bathroom and a bedroom"], "COCO_val2014_000000038029.jpg": ["A bathroom with a large sink and mirror opens onto a room with the toilet and bathtub."], "COCO_val2014_000000017756.jpg": ["The view of a large bathroom with a walk in closet."], "COCO_val2014_000000380932.jpg": ["A bathroom with a walk-in closet and a jacuzzi tub."], "COCO_val2014_000000155885.jpg": ["A white and beige tiled bathroom and adjoining walk-in closet."], "COCO_val2014_000000231408.jpg": ["White tiled bathroom with a vanity tub and white flowers."], "COCO_val2014_000000305821.jpg": ["Long shot of a bathroom includes closet and tub."], "COCO_val2014_000000459374.jpg": ["A white toilet sitting next to a green wall under a picture."], "COCO_val2014_000000190056.jpg": ["The letter A framed in a green bathroom."], "COCO_val2014_000000176649.jpg": ["There is a potted plant on the back of a toilet"], "COCO_val2014_000000121041.jpg": ["A white toilet and some tissue in a room."], "COCO_val2014_000000156397.jpg": ["A commode with a plant on it under a picture on the wall."], "COCO_val2014_000000173574.jpg": ["A bathroom with an enclosed shower next to a sink and a toilet."], "COCO_val2014_000000236182.jpg": ["A clean, spacious bathroom with a large shower stall."], "COCO_val2014_000000460347.jpg": ["There are a toilet, a sink, and a shower stall in a large bathroom."], "COCO_val2014_000000208589.jpg": ["A bathroom featuring a walk in shower, mirror, sink and toilet."], "COCO_val2014_000000334405.jpg": ["Bathroom with a shower, sink, and toilet in it. "], "COCO_val2014_000000267571.jpg": ["people on bicycles ride down a busy street "], "COCO_val2014_000000073830.jpg": ["A group of people are riding bikes down the street in a bike lane"], "COCO_val2014_000000158952.jpg": ["bike riders passing Burger King in city street"], "COCO_val2014_000000082258.jpg": ["A group of bicyclists are riding in the bike lane."], "COCO_val2014_000000308599.jpg": ["Bicyclists on a city street, most not using the bike lane"], "COCO_val2014_000000322864.jpg": ["This is an image of the inside of a nice bathroom."], "COCO_val2014_000000351053.jpg": ["A white toilet next to a walk in shower and a sink."], "COCO_val2014_000000157269.jpg": ["A potted plant is being displayed in a bathroom."], "COCO_val2014_000000495612.jpg": ["A tiled bathroom with a potted plant as a center piece."], "COCO_val2014_000000095022.jpg": ["Interior bathroom scene with modern furnishings including a plant."], "COCO_val2014_000000226111.jpg": ["Two dogs are looking up while they stand near the toilet in the bathroom."], "COCO_val2014_000000570045.jpg": ["Two small dogs standing in a restroom next to a toilet."], "COCO_val2014_000000191501.jpg": ["Two dogs looking up at a camera in a bathroom."], "COCO_val2014_000000153299.jpg": ["Two small lap dogs in a small bathroom."], "COCO_val2014_000000216482.jpg": ["Two small dogs stand together in a bathroom."], "COCO_val2014_000000358342.jpg": ["A bathroom with a walk in shower currently under repair."], "COCO_val2014_000000008665.jpg": ["A photograph of a bathroom undergoing major renovations."], "COCO_val2014_000000125997.jpg": ["Interior shot of bathroom in the process of remodeling."], "COCO_val2014_000000069911.jpg": ["Picture of bathroom being remolded where sink has not been installed. "], "COCO_val2014_000000573291.jpg": ["A room under construction with an unfinished shower and plumbing for the sink."], "COCO_val2014_000000322226.jpg": ["The bathroom is clean for the guests to use. "], "COCO_val2014_000000161470.jpg": ["A bath and a sink in a room."], "COCO_val2014_000000452224.jpg": ["A bathroom area with tub, sink and standup shower."], "COCO_val2014_000000322654.jpg": ["a view of a bathroom which is covered in tiles."], "COCO_val2014_000000110196.jpg": ["A kitchen is shown with a tub and a sink."], "COCO_val2014_000000564563.jpg": ["A white bath tub sitting next to a bathroom sink."], "COCO_val2014_000000375363.jpg": ["There is a bathtub and a counter in a bathroom."], "COCO_val2014_000000093201.jpg": ["A bathroom with a tub and shower and a sink."], "COCO_val2014_000000155877.jpg": ["This is a shower and bathtub without a shower curtain. "], "COCO_val2014_000000373591.jpg": ["A bathroom that has a mirror and a bathtub."], "COCO_val2014_000000308394.jpg": ["A full view of a shower with glass."], "COCO_val2014_000000338948.jpg": ["A walk in shower with a hand held shower head."], "COCO_val2014_000000084982.jpg": ["A bathroom shower stall with a shower head."], "COCO_val2014_000000386146.jpg": ["a glass walled shower in a home bathroom"], "COCO_val2014_000000456496.jpg": ["a see through glass shower in a bathroom "], "COCO_val2014_000000325690.jpg": ["A toilet sitting in a bathroom next to a sink."], "COCO_val2014_000000074711.jpg": ["A toilet in a bathroom with green faded paint."], "COCO_val2014_000000531854.jpg": ["A bathroom with a gouged wall and wall socket with no panel. "], "COCO_val2014_000000015113.jpg": ["The toilet is near the door in the bathroom."], "COCO_val2014_000000388325.jpg": ["The bathroom wall needs to be resurfaced and painted."], "COCO_val2014_000000058636.jpg": ["a couple of buckets in a white room"], "COCO_val2014_000000197461.jpg": ["A bathroom with no toilets and a red and green bucket. "], "COCO_val2014_000000144053.jpg": ["a shower room with two buckets, tolet paper holder and soap."], "COCO_val2014_000000075083.jpg": ["A standing toilet in a bathroom next to a window."], "COCO_val2014_000000271032.jpg": ["This picture looks like a janitors closet with buckets on the floor."], "COCO_val2014_000000098416.jpg": ["Blue dust pan and brush on floor next to white commode."], "COCO_val2014_000000078522.jpg": ["A toilet in a low budget bathroom with a rough floor."], "COCO_val2014_000000026767.jpg": ["a close up of a toilet and a dust pale"], "COCO_val2014_000000327807.jpg": ["A clean toilet in a bathroom with a cement floor."], "COCO_val2014_000000134778.jpg": ["a bathroom with a blue dustpan and broom on the floor "], "COCO_val2014_000000041888.jpg": ["A bathroom with a sink and toilet and a window."], "COCO_val2014_000000518586.jpg": ["A white bathroom with white fixtures and tile floor"], "COCO_val2014_000000065227.jpg": ["A small white toilet sitting next to a sink."], "COCO_val2014_000000049633.jpg": ["Small bathroom with a toilet, shower, and small mirror. "], "COCO_val2014_000000476597.jpg": ["A bathroom contains a toilet and a sink."], "COCO_val2014_000000165029.jpg": ["There are two sinks next to two mirrors."], "COCO_val2014_000000129699.jpg": ["Two very metallic sinks are shown as well as the mirrors above them."], "COCO_val2014_000000117125.jpg": ["A room with stainless steel equipment including sinks and mirrors."], "COCO_val2014_000000007211.jpg": ["Two stainless steel sinks with mirrors and a fire extinguisher. "], "COCO_val2014_000000356298.jpg": ["A photo of a bathroom made of steel."], "COCO_val2014_000000129942.jpg": ["A large porcelain toilet posed with a tan flower pot. "], "COCO_val2014_000000520433.jpg": ["A toilet is sitting on the ground next to a plant."], "COCO_val2014_000000183666.jpg": ["A toliet sitting on a curb in front of a house."], "COCO_val2014_000000184321.jpg": ["A white toilet sits on the front lawn."], "COCO_val2014_000000426175.jpg": ["A white toilet sitting on a sidewalk outside."], "COCO_val2014_000000336777.jpg": ["a gray bicycle is locked to some metal doors"], "COCO_val2014_000000249720.jpg": ["A bike that is padlocked to a wall."], "COCO_val2014_000000409009.jpg": ["The bicycle is locked on the green, metal wall. "], "COCO_val2014_000000554348.jpg": ["A bike chained to the doors of a building "], "COCO_val2014_000000329486.jpg": ["A bike is locked and hanging from a door."], "COCO_val2014_000000565778.jpg": ["A woman rides a bicycle on a road next to the median."], "COCO_val2014_000000231163.jpg": ["A girl is riding her bike down the street."], "COCO_val2014_000000297343.jpg": ["A lady riding her bicycle on the side of a street."], "COCO_val2014_000000336587.jpg": ["A person on a bike riding on a street."], "COCO_val2014_000000463633.jpg": ["A woman riding a bike down a street next to a divider."], "COCO_val2014_000000122745.jpg": ["A man takes a picture in the bathroom mirror\n"], "COCO_val2014_000000383470.jpg": ["a person taking a photo in a mirror "], "COCO_val2014_000000578292.jpg": ["A man taking a picture of a bathroom."], "COCO_val2014_000000075748.jpg": ["A bathroom sink sitting under a bathroom mirror."], "COCO_val2014_000000522778.jpg": ["A man takes a picture of his reflection in a mirror. "], "COCO_val2014_000000365366.jpg": ["A bathroom with a white toilet sitting next to a bathroom sink."], "COCO_val2014_000000046743.jpg": ["A bathroom vanity and toilet in a public restroom."], "COCO_val2014_000000554114.jpg": ["A view of a bathroom shows a toilet, sink and mirror."], "COCO_val2014_000000052644.jpg": ["A modern looking bathroom has a toilet and a sink. "], "COCO_val2014_000000269394.jpg": ["This bathroom has brown counter tops and a white toilet"], "COCO_val2014_000000117407.jpg": ["A bathroom with two sinks and a shower."], "COCO_val2014_000000183757.jpg": ["a big bathroom that has some sinks in it"], "COCO_val2014_000000437609.jpg": ["Bathroom vanity with double sinks and large mirrors."], "COCO_val2014_000000219578.jpg": ["A bathroom with sinks mirrors and tile flooring."], "COCO_val2014_000000434494.jpg": ["A bathroom that has two sinks next to each other."], "COCO_val2014_000000191738.jpg": ["The bathroom is clean and ready to be used. "], "COCO_val2014_000000542510.jpg": ["a small bathroom with a sink and a toilet."], "COCO_val2014_000000171500.jpg": ["A toilet, sink and mirror in the bathroom"], "COCO_val2014_000000146411.jpg": ["Doorway view into bathroom with a sink and toilet."], "COCO_val2014_000000555705.jpg": ["A white toilet sitting next to a sink."], "COCO_val2014_000000205103.jpg": ["A bath tub sitting next to a sink in a bathroom."], "COCO_val2014_000000472795.jpg": ["The bathroom is clean and ready for us to use."], "COCO_val2014_000000235006.jpg": ["a bath tub sitting next to a sink "], "COCO_val2014_000000182784.jpg": ["A bathroom that has a shower curtain over a bathtub."], "COCO_val2014_000000054088.jpg": ["A bathroom with multicolored tile, bathtub and pedestal sink."], "COCO_val2014_000000324383.jpg": ["an image of a cars driving on the highway"], "COCO_val2014_000000224861.jpg": ["A section of traffic coming to a stop at an intersection."], "COCO_val2014_000000443303.jpg": ["A bunch of cars sit at the intersection of a street."], "COCO_val2014_000000319865.jpg": ["This is a picture of traffic on a very busy street."], "COCO_val2014_000000353968.jpg": ["A busy intersection filled with cars in asia"], "COCO_val2014_000000500663.jpg": ["This shot is of a crowded highway full of traffic"], "COCO_val2014_000000458052.jpg": ["there are many taxi cabs on the road"], "COCO_val2014_000000309852.jpg": ["A city street with lots of traffic and lined with buildings."], "COCO_val2014_000000480076.jpg": ["Heavy city traffic all going in one direction"], "COCO_val2014_000000026942.jpg": ["Many cars stuck in traffic on a high way"], "COCO_val2014_000000346207.jpg": ["Mirror view of a bathroom with a sink and tub."], "COCO_val2014_000000190767.jpg": ["mirror reflection of sink and the tub next to it."], "COCO_val2014_000000418281.jpg": ["A bathroom mirror has the reflection of the sink and bathtub."], "COCO_val2014_000000490081.jpg": ["The bathroom is very small with white fixtures. "], "COCO_val2014_000000571034.jpg": ["A sink is shown in a small bathroom"], "COCO_val2014_000000372979.jpg": ["A city street filled with traffic and parking lights."], "COCO_val2014_000000384204.jpg": ["A full view of a late evening with many cars parked on the street."], "COCO_val2014_000000089668.jpg": ["A very dark street with cars and many wires above."], "COCO_val2014_000000383406.jpg": ["A car's break lights glow as it waits at a red-light at an intersection."], "COCO_val2014_000000013383.jpg": ["A street scene with cars, street signs, and many high wires."], "COCO_val2014_000000209692.jpg": ["A white toilet and a sink in a room."], "COCO_val2014_000000205378.jpg": ["White bathroom area with a blue and white shower curtain. "], "COCO_val2014_000000551952.jpg": ["Small bathroom area with a blue and white shower curtain hanging. "], "COCO_val2014_000000535292.jpg": ["A bath tub shower sitting next to a toilet."], "COCO_val2014_000000010694.jpg": ["A toilet with a sink and the door opened"], "COCO_val2014_000000143824.jpg": ["a small white bathroom with a curtain for the shower"], "COCO_val2014_000000037907.jpg": ["A bathroom sink shapped like a glass bowl."], "COCO_val2014_000000168706.jpg": ["A man that is standing with a mug in front of a mirror."], "COCO_val2014_000000414679.jpg": ["a man  taking a picture of himself in a bathroom mirror"], "COCO_val2014_000000486203.jpg": ["A man standing in a bathroom taking a picture of his self in the mirror with his cell phone"], "COCO_val2014_000000025560.jpg": ["a man taking a selfie in a little bathroom mirror "], "COCO_val2014_000000060687.jpg": ["A door opens to a bare, white bathroom. "], "COCO_val2014_000000122203.jpg": ["A varying palette of neutrals in a bathroom awaits the softening of the cabinetry."], "COCO_val2014_000000181449.jpg": ["A bathroom with a tile floor, bathtub and shower and no shower curtain."], "COCO_val2014_000000171062.jpg": ["A bathroom is shown with a shower and a toilet."], "COCO_val2014_000000142667.jpg": ["A beige and white three piece bathroom with no shower curtain."], "COCO_val2014_000000574184.jpg": ["A row of parked cars sitting next to parking meters."], "COCO_val2014_000000122390.jpg": ["A row of cars parked on a street with parking meters."], "COCO_val2014_000000099734.jpg": ["A series of parking meters and cars are located next to each other. "], "COCO_val2014_000000000400.jpg": ["A parking meter on a street by a car with traffic."], "COCO_val2014_000000245201.jpg": ["A parking meter on a street with cars"], "COCO_val2014_000000350694.jpg": ["An elegant bathroom features a tub, sink, mirror, and decorations. "], "COCO_val2014_000000419048.jpg": ["An old fashion above ground tub is shown with gold feet."], "COCO_val2014_000000414560.jpg": ["A lovely, vintage-styled bathroom with a great claw-footed tub. "], "COCO_val2014_000000232383.jpg": ["Bathroom with a pedestal sink and claw foot bathtub"], "COCO_val2014_000000403817.jpg": ["A claw foot tub is in a large bathroom near a pedestal sink."], "COCO_val2014_000000241453.jpg": ["A clean bathroom is seen in this image."], "COCO_val2014_000000178592.jpg": ["A bathroom with a white toilet and large shelf full of stuff."], "COCO_val2014_000000328421.jpg": ["some shelves filled with a bunch of different items in the bathroom\n"], "COCO_val2014_000000530212.jpg": ["A shelving unit is between a toilet and a bathroom sink. "], "COCO_val2014_000000278166.jpg": ["A shelf with hygiene products in a bathroom.\n"], "COCO_val2014_000000457754.jpg": ["A bathroom sink sitting under a large mirror."], "COCO_val2014_000000109819.jpg": ["A bathroom with a vanity cabinet on the wrong wall"], "COCO_val2014_000000260141.jpg": ["A small beige bathroom with an additional medicine cabinet."], "COCO_val2014_000000007682.jpg": ["A bathroom sink with a mirror and medicine cabinet."], "COCO_val2014_000000540264.jpg": ["THERE IS A BATHROOM WITH A SINK AND A MIRROR"], "COCO_val2014_000000246809.jpg": ["A white urinal mounted to a bathroom wall."], "COCO_val2014_000000102843.jpg": ["A pair of kitchen tongs on top of a urinal."], "COCO_val2014_000000412914.jpg": ["Bathroom urinal with kitchen tongs on top behind plumbing."], "COCO_val2014_000000085329.jpg": ["A urinal in a bathroom with tongs on top of it."], "COCO_val2014_000000440646.jpg": ["a metal thing is sitting on top of a urinal"], "COCO_val2014_000000242499.jpg": ["A glazed donut hanging from a metal rod."], "COCO_val2014_000000105975.jpg": ["A tasty looking treat hanging on a car antenna."], "COCO_val2014_000000066800.jpg": ["A donut on the antenna of a car."], "COCO_val2014_000000511204.jpg": ["A donut put around an antenna on a car "], "COCO_val2014_000000329323.jpg": ["There is a donut sitting on the car."], "COCO_val2014_000000030255.jpg": ["An orange striped tabby cat laying on top of a red vehicle's wheel."], "COCO_val2014_000000557981.jpg": ["a cat with a big fluffy tail sitting on top of a car tire "], "COCO_val2014_000000453819.jpg": ["A cat sitting on a wheel of a vehicle."], "COCO_val2014_000000260166.jpg": ["A cat hiding in a fender well of a car. "], "COCO_val2014_000000217005.jpg": ["An orange cat hiding on the wheel of a red car."], "COCO_val2014_000000239274.jpg": ["A large jetliner flying over a traffic filled street."], "COCO_val2014_000000207264.jpg": ["An airplane flies low in the sky over a city street. "], "COCO_val2014_000000370043.jpg": ["An airplane flies over a street with many cars."], "COCO_val2014_000000307936.jpg": ["An airplane comes in to land over a road full of cars"], "COCO_val2014_000000458153.jpg": ["The plane is flying over top of the cars"], "COCO_val2014_000000446751.jpg": ["A silver and red bus in parking lot next to cars."], "COCO_val2014_000000286994.jpg": ["A silver bus that is parked in a lot."], "COCO_val2014_000000511321.jpg": ["An older picture of a bus and other vehicles in a parking lot. "], "COCO_val2014_000000529917.jpg": ["An old bus parks in a parking lot with other cars and bus."], "COCO_val2014_000000451872.jpg": ["An older silver metro bus in a parking lot."], "COCO_val2014_000000031747.jpg": ["A red helmet is on a yellow toilet in the dirt."], "COCO_val2014_000000410533.jpg": ["A yellow toilet with a red helmet on top of it."], "COCO_val2014_000000247306.jpg": ["A yellow toilet with a red helmet above it."], "COCO_val2014_000000466774.jpg": ["A toilet sitting in an outdoor area with a helmet resting on top of it."], "COCO_val2014_000000420532.jpg": ["An old toilet sits in dirt with a helmet on top."], "COCO_val2014_000000154202.jpg": ["a little kid riding a skateboard at a park"], "COCO_val2014_000000421478.jpg": ["A child playing on a skateboard in a park."], "COCO_val2014_000000314294.jpg": ["A girl stepping onto a skateboard in the playground"], "COCO_val2014_000000387173.jpg": ["A young lady riding a skateboard across a street."], "COCO_val2014_000000516750.jpg": ["The kid is skateboarding on the street while wearing a jacket."], "COCO_val2014_000000289899.jpg": ["A young man wearing black attire and a flowered tie is standing and smiling."], "COCO_val2014_000000233771.jpg": ["A man with glasses and his eyes closed dressed in a black shirt and a necktie."], "COCO_val2014_000000419281.jpg": ["A man in a green tie with his eyes closed."], "COCO_val2014_000000069946.jpg": ["Smiling man wearing black shirt and pale green tie."], "COCO_val2014_000000109005.jpg": ["A person that is dressed up very nicely."], "COCO_val2014_000000216841.jpg": ["A car with some surfboards in a field."], "COCO_val2014_000000338327.jpg": ["The old fashioned car is carrying some retro surfboards."], "COCO_val2014_000000077184.jpg": ["An old car with surfboards on the top."], "COCO_val2014_000000291712.jpg": ["An old vehicle painted light blue and dark blue."], "COCO_val2014_000000024430.jpg": ["An old station wagon with a surfboard on top of it."], "COCO_val2014_000000014990.jpg": ["A person on a street next to a motor bike."], "COCO_val2014_000000167854.jpg": ["A cop standing next to a police bike next to a man sitting on a  curb."], "COCO_val2014_000000032965.jpg": ["A man sits on the sidewalk next to a police motorcycle with a police officer in the background."], "COCO_val2014_000000553442.jpg": ["A man that is sitting down next to a cops motorcycle."], "COCO_val2014_000000240903.jpg": ["A man is sitting on the sidewalk while a police officer is doing something behind him."], "COCO_val2014_000000207056.jpg": ["A man looking down with a backpack on in a house."], "COCO_val2014_000000476975.jpg": ["THERE IS A MAN WITH BOOK BAG ON HIS BAG "], "COCO_val2014_000000323682.jpg": ["a person standing in a stone walled and floored room wearing a backpack "], "COCO_val2014_000000475779.jpg": ["A guy standing in a very dark room with a small window."], "COCO_val2014_000000304305.jpg": ["A man in a stone room possibly using the bathroom"], "COCO_val2014_000000076460.jpg": ["A cat on the lid of a toilet looking perturbed."], "COCO_val2014_000000468604.jpg": ["A blurry picture of a cat standing on a toilet."], "COCO_val2014_000000035474.jpg": ["A cat standing on the toilet bowl seat"], "COCO_val2014_000000041945.jpg": ["A cat is perched on the top of a toilet seat in the bathroom."], "COCO_val2014_000000015690.jpg": ["A cat standing on a toilet with an open lid."], "COCO_val2014_000000102912.jpg": ["A toilet sitting in a bathroom next to a mirror."], "COCO_val2014_000000301867.jpg": ["A small bathroom with the toilet seat up."], "COCO_val2014_000000261779.jpg": ["The toilet seat was left in the up position."], "COCO_val2014_000000227227.jpg": ["A door open revealing a small bathroom with sink and toilet."], "COCO_val2014_000000198448.jpg": ["A toilet and a sink in a small bathroom."], "COCO_val2014_000000312421.jpg": ["The shiny motorcycle has been put on display."], "COCO_val2014_000000122934.jpg": ["The new motorcycle on display is very shiny."], "COCO_val2014_000000421681.jpg": ["A motorcycle is parked inside of a building."], "COCO_val2014_000000181714.jpg": ["A brand new motorcycle on display at a show."], "COCO_val2014_000000449981.jpg": ["The front end of a red motorcycle that is on display."], "COCO_val2014_000000573349.jpg": ["A row of white toilets sitting on top of a dirt ground."], "COCO_val2014_000000247984.jpg": ["A bunch of dirty looking white toilets in a row outside."], "COCO_val2014_000000429580.jpg": ["There is a row of used and broken toilets in a field."], "COCO_val2014_000000185250.jpg": ["A row of toilets with broken seat tops on the ground."], "COCO_val2014_000000450247.jpg": ["LOTS OF BROKEN TOILETS SITTING OUT ON A LAWN"], "COCO_val2014_000000329717.jpg": ["Bathroom with white fixtures, tiles and corner shower."], "COCO_val2014_000000393258.jpg": ["A white toilet sitting in a bathroom next to a shower."], "COCO_val2014_000000247285.jpg": ["Bathroom shot of non transparent shower glass and toilet."], "COCO_val2014_000000314154.jpg": ["An all white bathroom with a shower, toilet and sink."], "COCO_val2014_000000579815.jpg": ["A plain white bathroom with a sink, shower, and toilet."], "COCO_val2014_000000042069.jpg": ["An older building with birds flying near it."], "COCO_val2014_000000511136.jpg": ["A church with a high spire and decorative roof tiles."], "COCO_val2014_000000341393.jpg": ["A large clock tower towering over a small city."], "COCO_val2014_000000299319.jpg": ["Picture of a church and its tall steeple."], "COCO_val2014_000000185768.jpg": ["Birds fly around a tall building with a clock."], "COCO_val2014_000000139530.jpg": ["a motorcycle in a driveway with a vanity license plate "], "COCO_val2014_000000504142.jpg": ["Two luxurious motor bikes on the road near a hedge."], "COCO_val2014_000000288955.jpg": ["a close up of a motorcycle license plate"], "COCO_val2014_000000356427.jpg": ["A motor bike parked on the side of the road."], "COCO_val2014_000000407368.jpg": ["The back of a motorcycle showing the wheel, license plate and lights. "], "COCO_val2014_000000553162.jpg": ["A picture of a wooden container with crosses on it."], "COCO_val2014_000000515779.jpg": ["a close up of wood decorated with crosses"], "COCO_val2014_000000262986.jpg": ["close up of a wooden base with crosses designed on the neck"], "COCO_val2014_000000077187.jpg": ["A close up shut off some sort of religious object. "], "COCO_val2014_000000156416.jpg": ["A shiny wooden object is decorated with crosses."], "COCO_val2014_000000479057.jpg": ["There is a man picking bananas next to a street."], "COCO_val2014_000000563964.jpg": ["A man standing over several bunches of green bananas."], "COCO_val2014_000000103579.jpg": ["A man attending to several bundles of banana's as a motorcycle rides by."], "COCO_val2014_000000236189.jpg": ["A guy grabbing a stack of bananas from a pile on the side of the road."], "COCO_val2014_000000240028.jpg": ["A man standing over some bundles of bananas"], "COCO_val2014_000000062060.jpg": ["A restroom has a toilet and a decorative sun wall plaque."], "COCO_val2014_000000572517.jpg": ["A picture of a very nice and white toilet."], "COCO_val2014_000000438723.jpg": ["A bathroom with a white toilet in the middle of the wall and a sun wall decor above it."], "COCO_val2014_000000386500.jpg": ["A bath room with a sun decoration above the toilet"], "COCO_val2014_000000324937.jpg": ["A bathroom has a sun decal on the wall."], "COCO_val2014_000000557556.jpg": ["A small closed toilet in a cramped space."], "COCO_val2014_000000426578.jpg": ["A tan toilet and sink combination in a small room."], "COCO_val2014_000000278506.jpg": ["This is an advanced toilet with a sink and control panel."], "COCO_val2014_000000501762.jpg": ["A close-up picture of a toilet with a fountain."], "COCO_val2014_000000370423.jpg": ["Off white toilet with a faucet and controls. "], "COCO_val2014_000000406932.jpg": ["some horses grazing in front of a church"], "COCO_val2014_000000293554.jpg": ["Three horses on a green pasture with an old building in the background."], "COCO_val2014_000000018149.jpg": ["A filed with brown horses standing next to a church."], "COCO_val2014_000000289423.jpg": ["Three horses are grazing in a field in front of an old church."], "COCO_val2014_000000155743.jpg": ["horses eating grass in a field with trees in the background"], "COCO_val2014_000000064710.jpg": ["A horse drawn carriage is parked along the curb."], "COCO_val2014_000000180447.jpg": ["A horse drawn carriage is in front of an old large building."], "COCO_val2014_000000318171.jpg": ["A pair of horses carrying a carriage that is parked by a street."], "COCO_val2014_000000216273.jpg": ["A horse drawn carriage parked on the street."], "COCO_val2014_000000270244.jpg": ["People walking pass a horse drawn carriage sitting at the curb"], "COCO_val2014_000000075162.jpg": ["a toilet on the ground outdoors in front of a house"], "COCO_val2014_000000283210.jpg": ["A toilet sitting in the middle of the road beside a home. "], "COCO_val2014_000000252213.jpg": ["A toilet on the pavement in front of a house, the tank lid lying discarded."], "COCO_val2014_000000082680.jpg": ["An old looking toilet sitting out on the side walk."], "COCO_val2014_000000469088.jpg": ["A toilet sitting in front of someones house. "], "COCO_val2014_000000496768.jpg": ["The shiny motorcycle is being shown on a display."], "COCO_val2014_000000562261.jpg": ["A motor bike parked inside of a building."], "COCO_val2014_000000016716.jpg": ["A parked motorcycle sitting next to a crowd."], "COCO_val2014_000000517822.jpg": ["White motorcycle on display inside a building with people looking on. "], "COCO_val2014_000000443591.jpg": ["A motorcycle sits displayed in a large shopping area."], "COCO_val2014_000000344860.jpg": ["Horses graze in front of a large building amid snow."], "COCO_val2014_000000516316.jpg": ["Several horses eating grass around melting a snow spot"], "COCO_val2014_000000125211.jpg": ["some horses eating grass by a big house"], "COCO_val2014_000000562121.jpg": ["Horses grazing in a field by a large home."], "COCO_val2014_000000235914.jpg": ["A couple of horses grazing in front of an estate."], "COCO_val2014_000000148358.jpg": ["A large clock tower with a wind indicator on top."], "COCO_val2014_000000104025.jpg": ["A very tall clock tower towering over a city."], "COCO_val2014_000000062790.jpg": ["A clock tower has a weather vane on top of it."], "COCO_val2014_000000129637.jpg": ["Blue and orange stone clock tower with a small clock."], "COCO_val2014_000000427438.jpg": ["A large clock tower in front of a clear sky"], "COCO_val2014_000000002684.jpg": ["A woman is riding a motorcycle down the street."], "COCO_val2014_000000256091.jpg": ["A woman on a motorcycle wearing a bag and passing a car. "], "COCO_val2014_000000433460.jpg": ["A woman on a motor cycle on a city street"], "COCO_val2014_000000307569.jpg": ["A woman on a motorcycle in the middle of the street."], "COCO_val2014_000000181962.jpg": ["A woman sits on her motorcycle in the street."], "COCO_val2014_000000360661.jpg": ["A motorcycle sitting on the side of a street corner."], "COCO_val2014_000000120935.jpg": ["Black motorcycle parked on the side of a busy street. "], "COCO_val2014_000000405778.jpg": ["A motorcycle is sitting outside on the street near a tree."], "COCO_val2014_000000520727.jpg": ["a black motorcycle is parked on a sidewalk"], "COCO_val2014_000000062151.jpg": ["An unattended motorcycle parked along a curb on roadway."], "COCO_val2014_000000353807.jpg": ["A small white toilet sitting next to a metal trash can."], "COCO_val2014_000000440329.jpg": ["A compact toilet and shower of a small bathroom"], "COCO_val2014_000000248468.jpg": ["A close up shot of a white toilet and waste bin."], "COCO_val2014_000000112085.jpg": ["A small white toilette with the lid closed has a metal trash can on one side and a shower stall on the other."], "COCO_val2014_000000379977.jpg": ["a toilet bowl and a trash can in a bathroom"], "COCO_val2014_000000444444.jpg": ["A purple motorcycle parked in front of a red brick building."], "COCO_val2014_000000345998.jpg": ["A motorcycle that is parked in front of a brick building."], "COCO_val2014_000000497312.jpg": ["A sport motorbike parked on a pavement close to a building"], "COCO_val2014_000000016228.jpg": ["A blur motorcycle against a red brick wall."], "COCO_val2014_000000143769.jpg": ["A motor bike parked on the side of the street."], "COCO_val2014_000000311913.jpg": ["A few people working on various computers in an office."], "COCO_val2014_000000461885.jpg": ["A man works on a laptop placed on a table in a busy office."], "COCO_val2014_000000328289.jpg": ["A man is working on a laptop computer at a desk."], "COCO_val2014_000000318671.jpg": ["A man in blue works on a laptop computer."], "COCO_val2014_000000031255.jpg": ["A man sitting in front of a laptop computer."], "COCO_val2014_000000244575.jpg": ["Black and white photograph of two men on motorcycles."], "COCO_val2014_000000079380.jpg": ["Two people riding a motorcycle with hats and backpack down a street."], "COCO_val2014_000000175417.jpg": ["Two men are at an intersection on motorcycles."], "COCO_val2014_000000503005.jpg": ["The man are driving side by side on their motorcycles. "], "COCO_val2014_000000382088.jpg": ["Two men on motorcycles at a stop light"], "COCO_val2014_000000016574.jpg": ["People are walking and riding motorcycles on the street"], "COCO_val2014_000000300814.jpg": ["A group of motorists pass very large buildings in asia. "], "COCO_val2014_000000316795.jpg": ["A bunch of bikers are gathered on a city street. "], "COCO_val2014_000000263136.jpg": ["people ride their motorcycles beside some cars, passing by an empty street with stores and apartment buildings"], "COCO_val2014_000000084235.jpg": ["A view of motorcyclists riding their bikes through heavy city traffic."], "COCO_val2014_000000310177.jpg": ["Two blue bowls of food next to a bottle of cinnamon and sugar."], "COCO_val2014_000000227879.jpg": ["this is an image of cereal and milk"], "COCO_val2014_000000321079.jpg": ["A desert of bananas and cinnamon in two blue bowls."], "COCO_val2014_000000535668.jpg": ["A blue bowl holding mashed bananas and oatmeal with a bottle of sugar and cinnamon sitting beside it."], "COCO_val2014_000000375840.jpg": ["A bowl of oatmeal is ready to eat with some cinnamon and sugar."], "COCO_val2014_000000466787.jpg": ["Rows of motor bikes and helmets in a city"], "COCO_val2014_000000288403.jpg": ["A lot of motorbikes line up down a busy street."], "COCO_val2014_000000147980.jpg": ["Large set of motorcycles all lined up down a street."], "COCO_val2014_000000313789.jpg": ["A large group of motorcycles lined up on the street."], "COCO_val2014_000000121745.jpg": ["A series of motorbikes parked in a row on a street"], "COCO_val2014_000000497006.jpg": ["Two rows of various makes of parked motorcycles."], "COCO_val2014_000000136501.jpg": ["a bunch of motorcycles are parked tightly together"], "COCO_val2014_000000295589.jpg": ["Rows and columns of motorcycles in middle of street."], "COCO_val2014_000000037038.jpg": ["A bunch of motorcycles that are grouped together."], "COCO_val2014_000000511117.jpg": ["Motorcycles are lined up outside along the street. "], "COCO_val2014_000000246199.jpg": ["A row of motorcycles parked in front of a building."], "COCO_val2014_000000095427.jpg": ["A bunch of motorcycles parked on the side of the road"], "COCO_val2014_000000180800.jpg": ["a back ally neighborhood with motor bikes in a row"], "COCO_val2014_000000485709.jpg": ["A number of motorbikes parked on an alley"], "COCO_val2014_000000146973.jpg": ["a bunch of motorcycles parked along the side of the street "], "COCO_val2014_000000098590.jpg": ["A row of motorcycles parked next to each other on a lush green field."], "COCO_val2014_000000557360.jpg": ["Several motorcycles parked beneath trees in a park."], "COCO_val2014_000000114549.jpg": ["THERE ARE A LOT OF MOTOR BIKES ON THE GRASS"], "COCO_val2014_000000376549.jpg": ["a line of parked motorcycles on some grass and trees"], "COCO_val2014_000000536831.jpg": ["A bunch of motorcycles line up near trees."], "COCO_val2014_000000034180.jpg": ["Two people on mopeds passing in front of a building."], "COCO_val2014_000000169802.jpg": ["two people riding scooter on a city street"], "COCO_val2014_000000317560.jpg": ["People on mopeds in front of a building."], "COCO_val2014_000000144200.jpg": ["People riding motorcycles in front of a building"], "COCO_val2014_000000138975.jpg": ["an image of a boy on his bike riding past a building"], "COCO_val2014_000000266409.jpg": ["a person sitting at a desk with a keyboard and monitor "], "COCO_val2014_000000430961.jpg": ["a woman at her desk sits intently and happy"], "COCO_val2014_000000570465.jpg": ["A woman sitting at a desk in her work station"], "COCO_val2014_000000094590.jpg": ["The woman is working on her computer at the desk."], "COCO_val2014_000000162827.jpg": ["a woman is sitting in front of a desk"], "COCO_val2014_000000208663.jpg": ["Office space with office equipment on desk top."], "COCO_val2014_000000410632.jpg": ["A hope office setup of computers and printers."], "COCO_val2014_000000248242.jpg": ["a home office with laptop, printer, scanner, and extra monitor"], "COCO_val2014_000000080671.jpg": ["The computer desk in the corner is by a window."], "COCO_val2014_000000010442.jpg": ["A laptop, monitor, printer and tablet on a desk."], "COCO_val2014_000000356708.jpg": ["A building wall and pair of doors that are open, along with vases of flowers on the outside of the building."], "COCO_val2014_000000419856.jpg": ["a building with dirty walls and dirty doors"], "COCO_val2014_000000397773.jpg": ["a run down building with two planters outside the door"], "COCO_val2014_000000400139.jpg": ["a yellow and brown wall a gray door and a sign "], "COCO_val2014_000000027353.jpg": ["A plaster external wall with multiple old paper images attached."], "COCO_val2014_000000210103.jpg": ["A computer that is on a desk near a window."], "COCO_val2014_000000362368.jpg": ["An office desk in front of a large window overlooking a parking lot"], "COCO_val2014_000000577539.jpg": ["this is a desk with a computer on it"], "COCO_val2014_000000519706.jpg": ["A corner desk with a laptop and other office equipment"], "COCO_val2014_000000040881.jpg": ["A office desk,  with a view of a parking lot. "], "COCO_val2014_000000472246.jpg": ["A fluffy white chair that faces away fro a television."], "COCO_val2014_000000420229.jpg": ["A pillow covered reading chair in the corner of the living room"], "COCO_val2014_000000564659.jpg": ["The living room is empty with the television on. "], "COCO_val2014_000000308026.jpg": ["White ornate seat in nicely decorated room with television."], "COCO_val2014_000000010142.jpg": ["A white chair, books and shelves and a tv on in this room."], "COCO_val2014_000000311553.jpg": ["A close-up of a one-way street with many cars and motorcycles."], "COCO_val2014_000000016497.jpg": ["Straight ahead view of several lanes of traffic heading this way"], "COCO_val2014_000000572051.jpg": ["Cars, motorized scooters, and other vehicles stopped on a busy road."], "COCO_val2014_000000185036.jpg": ["Bikers on bikes in front of a lot of traffic\n"], "COCO_val2014_000000273045.jpg": ["a group of motorcycle riders stopped in traffic next to cars"], "COCO_val2014_000000287570.jpg": ["this living room has a small tv and a lamp next to it"], "COCO_val2014_000000140007.jpg": ["A big screen television is sitting on a stand in a room."], "COCO_val2014_000000041687.jpg": ["A large television and table in a room."], "COCO_val2014_000000104612.jpg": ["Living room with flat screen TV and surround sound."], "COCO_val2014_000000493868.jpg": ["A flat screen television in a room with yellow walls."], "COCO_val2014_000000119181.jpg": ["A group of men riding motorcycle down a country road."], "COCO_val2014_000000296303.jpg": ["a street with some motorcycles driving through it"], "COCO_val2014_000000258516.jpg": ["A white car driving down the highway with three motorcycles."], "COCO_val2014_000000341041.jpg": ["Three motorcycles are driving swiftly behind a white car."], "COCO_val2014_000000406404.jpg": ["a blurry image of motorcycles and a car driving along a highway"], "COCO_val2014_000000560108.jpg": ["A painting of a table with fruit on top of it."], "COCO_val2014_000000352194.jpg": ["Painting of oranges, a bowl, candle, and a pitcher"], "COCO_val2014_000000216228.jpg": ["a painting of fruit and a candle with a vase"], "COCO_val2014_000000476258.jpg": ["A painting of a candlestick holder with a candle, several pieces of fruit and a vase, with a gold frame around the painting."], "COCO_val2014_000000448365.jpg": ["A painting that has a gold frame on it."], "COCO_val2014_000000143671.jpg": ["This is a case full of yellow bananas. "], "COCO_val2014_000000285291.jpg": ["Bananas a tightly packed and boxed for delivery to the market."], "COCO_val2014_000000064822.jpg": ["a bunch of bananas are packaged up in boxes"], "COCO_val2014_000000420775.jpg": ["Bananas packed in cardboard box covered in plastic."], "COCO_val2014_000000153656.jpg": ["An unopened box full of perfectly ripe bananas."], "COCO_val2014_000000472854.jpg": ["Vegetables are displayed in a wooden barrel outdoors."], "COCO_val2014_000000035197.jpg": ["A bunch of bananas are sitting on the stand."], "COCO_val2014_000000330835.jpg": ["The cart has bananas or plantains piled on it. "], "COCO_val2014_000000347170.jpg": ["a box of green bananas and a box of ripe bananas "], "COCO_val2014_000000349860.jpg": ["A large number of green and yellow bananas in wooden containers."], "COCO_val2014_000000234572.jpg": ["A polie officer standing next to a  motorcycle parked on the street."], "COCO_val2014_000000072944.jpg": ["A scene depicting a man sitting down on a curb and a motor cop writing a ticket"], "COCO_val2014_000000383137.jpg": ["A man and police officer on the sidewalk next to a motorcycle."], "COCO_val2014_000000065415.jpg": ["A man sitting on a curb with a police officer behind him. "], "COCO_val2014_000000204049.jpg": ["A motorcycle police officer is writing a ticket."], "COCO_val2014_000000335472.jpg": ["a person riding a motorcycle on an enclosed road"], "COCO_val2014_000000180135.jpg": ["A motorcycle and a rider on a race track"], "COCO_val2014_000000234500.jpg": ["A person on a motorcycle driving around a racetrack."], "COCO_val2014_000000272110.jpg": ["A person riding a motor cycle down a race track."], "COCO_val2014_000000577826.jpg": ["Racer driving a high performance motorcycle on track"], "COCO_val2014_000000385861.jpg": ["A large pitcher of some beverage is on the table next to orange slices."], "COCO_val2014_000000059202.jpg": ["A cold pitcher of orange juice beside a bowl of orange slices."], "COCO_val2014_000000383419.jpg": ["A pitcher of beer is sitting next to a cup of orange slices. "], "COCO_val2014_000000041369.jpg": ["A pitcher of beer stands next to a dish containing orange slices."], "COCO_val2014_000000262873.jpg": ["a pitcher of liquid sitting on a table next to some sliced oranges"], "COCO_val2014_000000303590.jpg": ["Motorcycles driving down a wide city street nearing a white building."], "COCO_val2014_000000483234.jpg": ["A large building with many windows and people riding scooters nearby"], "COCO_val2014_000000553667.jpg": ["People are riding scooters down the middle of the road."], "COCO_val2014_000000173704.jpg": ["People are riding electric scooters in front of a large building."], "COCO_val2014_000000404243.jpg": ["Many motorcycles riding in front of a KFC."], "COCO_val2014_000000127451.jpg": ["Two people on motorbike passing by a clock facade."], "COCO_val2014_000000109092.jpg": ["Two people are riding a red bike down the street."], "COCO_val2014_000000514083.jpg": ["Two people riding on top of one motorcycle."], "COCO_val2014_000000461953.jpg": ["Two people are on a motorcycle driving down the street."], "COCO_val2014_000000025202.jpg": ["The couple scoots around town on the motorbike."], "COCO_val2014_000000486438.jpg": ["A bunch of birds sitting in a bread basket."], "COCO_val2014_000000400573.jpg": ["Two birds perched on a bread basked on a table."], "COCO_val2014_000000495107.jpg": ["Two finch birds standing next to a basket of bread. "], "COCO_val2014_000000413044.jpg": ["Birds are standing in a basket on the table."], "COCO_val2014_000000399012.jpg": ["three birds sitting on a bread basket near a newspaper"], "COCO_val2014_000000523772.jpg": ["Grey bird in a wooden basket eating bread."], "COCO_val2014_000000109798.jpg": [" A basket of bread with a small bird eating it."], "COCO_val2014_000000436795.jpg": ["Bread sitting in a basket on a table beside a newspaper. "], "COCO_val2014_000000413321.jpg": ["A bird is eating bread from a basket on a table."], "COCO_val2014_000000557780.jpg": ["A bowl of bread and newspaper laid on a table."], "COCO_val2014_000000370677.jpg": ["A motorbike sitting in front of a wine display case"], "COCO_val2014_000000299116.jpg": ["A motor bike and some wine in a room."], "COCO_val2014_000000569839.jpg": ["A dirt bike sitting on a counter by some wine bottles."], "COCO_val2014_000000313155.jpg": ["a motorcycle standing in front a winery "], "COCO_val2014_000000375521.jpg": ["A bike sits among bottles of wine on a shelf. "], "COCO_val2014_000000066412.jpg": ["A wooden bench sitting next to an entrance."], "COCO_val2014_000000404464.jpg": ["A green wooden bench in front of a house."], "COCO_val2014_000000054277.jpg": ["A green bench in front of a window box"], "COCO_val2014_000000319908.jpg": ["a green, warped bench outside of a small cottage with a flowers in the window"], "COCO_val2014_000000188958.jpg": ["The front of a small cabin with a window garden and green bench."], "COCO_val2014_000000238866.jpg": ["A dog watches an animal on the television."], "COCO_val2014_000000410002.jpg": ["Large brown dog facing away, watching TV with wildlife scene."], "COCO_val2014_000000533750.jpg": ["A big brown dog is watching a television."], "COCO_val2014_000000507065.jpg": ["The hound dog sits on a rug and watches another dog on the television set."], "COCO_val2014_000000540174.jpg": ["A dog is sitting in front of a television."], "COCO_val2014_000000446322.jpg": ["A picture advertising Arizona tourism in an airport"], "COCO_val2014_000000415746.jpg": ["A television that is sitting next to signs"], "COCO_val2014_000000369370.jpg": ["A television is shown in the middle of a baggage claim area."], "COCO_val2014_000000334686.jpg": ["An airport terminal has a big screen displaying an ad for Arizona."], "COCO_val2014_000000280819.jpg": ["A flat screen TV with a picture of a person jumping on it."], "COCO_val2014_000000005754.jpg": ["the person is sitting at a desk  with a television behind him "], "COCO_val2014_000000071171.jpg": ["A person sitting at a table in a room."], "COCO_val2014_000000556462.jpg": ["A man who is sitting at a table."], "COCO_val2014_000000502737.jpg": ["A man in a news room sits in front of a camera. "], "COCO_val2014_000000292301.jpg": ["A man sitting a desk in front of a TV."], "COCO_val2014_000000550627.jpg": ["A car passes by to find a man outside near a TV."], "COCO_val2014_000000266041.jpg": ["A picture of a man sitting on the sidewalk next to a television set and backpack."], "COCO_val2014_000000244339.jpg": ["A picture taken out of a vehicle of a man sitting outside beside a tv."], "COCO_val2014_000000515579.jpg": ["Man sitting next to a TV on a sidewalk."], "COCO_val2014_000000427135.jpg": ["A person sitting net to a TV on a sidewalk."], "COCO_val2014_000000578210.jpg": ["A black man is sitting on the sidewalk next to a television."], "COCO_val2014_000000201925.jpg": ["A four engine jet transport airplane flying low."], "COCO_val2014_000000072833.jpg": ["A large airplane flying over a grassy field with trees."], "COCO_val2014_000000269089.jpg": ["jumbo jet comes in for a landing over some trees"], "COCO_val2014_000000045864.jpg": ["An airplane taking off over a field next to a forest. "], "COCO_val2014_000000562614.jpg": ["A jumbo jet plane in flight with a city in the background."], "COCO_val2014_000000541010.jpg": ["The side of an airplane that is parked, and an Air China sign on the side of the plane."], "COCO_val2014_000000289444.jpg": ["An Air China airplane sitting on the runway "], "COCO_val2014_000000515445.jpg": ["This is the jet engine and side of an airplane."], "COCO_val2014_000000570579.jpg": ["a parked air plane sit at a airfield "], "COCO_val2014_000000094194.jpg": ["A view of the airplane looking down from the head."], "COCO_val2014_000000173383.jpg": ["A man in a safety vest holds him arms up as he stands in front of an airplane."], "COCO_val2014_000000143541.jpg": ["an airport employee giving directions to an airplane"], "COCO_val2014_000000284350.jpg": ["An air traffic controller directing an airplane on a busy runway."], "COCO_val2014_000000309120.jpg": ["A person reflective gear directing an airplane "], "COCO_val2014_000000146193.jpg": ["A person directing a white jet airliner with orange sticks."], "COCO_val2014_000000467477.jpg": ["A large jetliner sitting on top of an airport runway."], "COCO_val2014_000000172327.jpg": ["Airline employees by an aircraft parked at the gate"], "COCO_val2014_000000153570.jpg": ["The plane is parked at the gate at the airport terminal."], "COCO_val2014_000000550444.jpg": ["View from gate of jet connected to jet way for passengers to board or deplane"], "COCO_val2014_000000438862.jpg": ["A large white airplane and a person on a lot."], "COCO_val2014_000000154971.jpg": ["a large air plane is parked out on a grass field"], "COCO_val2014_000000282225.jpg": ["A vintage propeller plane parked in a grassy area with other older planes."], "COCO_val2014_000000146723.jpg": ["Someone sitting in a renovated propellor fighter plane on a tarmac"], "COCO_val2014_000000489023.jpg": ["Pilot sitting inside an old style war plane"], "COCO_val2014_000000453757.jpg": ["A very nice looking fighter type plane in the grass."], "COCO_val2014_000000321674.jpg": ["A small airplane taking off from an airport runway."], "COCO_val2014_000000195829.jpg": ["A Curtiss P-40 Warhawk taxis along a runway."], "COCO_val2014_000000398076.jpg": ["A small airplane that is getting ready to take off from the runway. "], "COCO_val2014_000000310227.jpg": ["a small air plane getting ready to take off ."], "COCO_val2014_000000180560.jpg": ["An airplane is about to fly into the sky. "], "COCO_val2014_000000453926.jpg": ["An airport filled with planes sitting on tarmacs."], "COCO_val2014_000000347693.jpg": ["The view of runway from behind the windows of airport."], "COCO_val2014_000000090935.jpg": ["a truck driving towards some planes parked on the runway"], "COCO_val2014_000000039956.jpg": ["Planes on a wet tarmac unloading at arrival gates."], "COCO_val2014_000000542959.jpg": ["Window view from the inside of airplanes, baggage carrier and tarmac. "], "COCO_val2014_000000295837.jpg": ["A plane just outside of a terminal with other planes in the background."], "COCO_val2014_000000321214.jpg": ["Several planes on the tarmac at an airport. "], "COCO_val2014_000000279305.jpg": ["a very large airplane that is on a runway"], "COCO_val2014_000000207826.jpg": ["there is a white plane that is at this airport"], "COCO_val2014_000000474028.jpg": ["A small regional jet pulls to a gate at an airport."], "COCO_val2014_000000224757.jpg": ["An airplane sits on the tarmac of an airport, with a disconnected boarding gate."], "COCO_val2014_000000385786.jpg": ["Plane boarding passengers while at a fancy airport"], "COCO_val2014_000000165133.jpg": ["A plane sitting on a runway getting ready to be emptied."], "COCO_val2014_000000066523.jpg": ["THIS IS A AIRPLANE ON THE RUNWAY OF THE AIRPORT"], "COCO_val2014_000000336102.jpg": ["A plan parked on the cement near a terminal."], "COCO_val2014_000000355257.jpg": ["Set of toy animals sitting in front of a red wooden wagon."], "COCO_val2014_000000017707.jpg": ["Several toy animals - a bull, giraffe, deer and parakeet."], "COCO_val2014_000000140743.jpg": ["Some toy animals on the ground near a picture"], "COCO_val2014_000000066423.jpg": ["Children's toy animals are strewn across a floor."], "COCO_val2014_000000142092.jpg": ["A display of vintage animal toys on the floor."], "COCO_val2014_000000063154.jpg": ["A man sitting on a large bench talking on a cell phone."], "COCO_val2014_000000476280.jpg": ["A man sitting on a modern bench talking on a phone."], "COCO_val2014_000000182245.jpg": ["A man sitting on a black and yellow bench on the phone."], "COCO_val2014_000000001369.jpg": ["A man is sitting on a public bench on a busy city street."], "COCO_val2014_000000199551.jpg": ["Man talking on personal cell phone on a yellow and black bench."], "COCO_val2014_000000430125.jpg": ["a car is stopped in the street for people to cross"], "COCO_val2014_000000546702.jpg": ["a white car is pulled up and stopped at a line"], "COCO_val2014_000000177941.jpg": ["A car at an intersection while a man is crossing the street. "], "COCO_val2014_000000053015.jpg": ["a silver car under a signal light that is green with a man in the  crosswalk"], "COCO_val2014_000000239347.jpg": ["A car that is sitting near a green street light."], "COCO_val2014_000000514508.jpg": ["A traffic signal sitting next to a street at night."], "COCO_val2014_000000504304.jpg": ["Traffic light at night, appearing very confusing. "], "COCO_val2014_000000054796.jpg": ["The electronic stop sign glows brightly at night time."], "COCO_val2014_000000124629.jpg": ["A variety of traffic lights and road signs."], "COCO_val2014_000000310302.jpg": ["There is a street light with two green arrows in different directions"], "COCO_val2014_000000353830.jpg": ["A small blue plane sitting on top of a field."], "COCO_val2014_000000493652.jpg": ["an E2 airplane painted blue with black and white stripes "], "COCO_val2014_000000226278.jpg": ["An old warplane is on display in a field.  "], "COCO_val2014_000000399839.jpg": ["a blue small plane standing at the airstrip"], "COCO_val2014_000000039540.jpg": ["Model airplane with an American insignia and stripes on wings."], "COCO_val2014_000000301102.jpg": ["Man bending down to check out a model plain that is parked in the grass"], "COCO_val2014_000000473237.jpg": ["Man behind a radio operated model airplane on the ground."], "COCO_val2014_000000317595.jpg": ["The man is crouched down with a small airplane model. "], "COCO_val2014_000000053990.jpg": ["a small red and white toy plane in the grass"], "COCO_val2014_000000190081.jpg": ["A man smiles while kneeling beside a miniature airplane."], "COCO_val2014_000000521400.jpg": ["A small plane flying through a cloudy blue sky."], "COCO_val2014_000000228144.jpg": ["Red and white small plane on partially cloudy day."], "COCO_val2014_000000193565.jpg": ["A red and white biplane in a blue, cloudy sky."], "COCO_val2014_000000207151.jpg": ["A plane that is flying in the air."], "COCO_val2014_000000057387.jpg": ["A small lightweight airplane flying through the sky."], "COCO_val2014_000000577858.jpg": ["A park bench siting next to a tree next to a  park."], "COCO_val2014_000000409944.jpg": ["Green park bench in front of a tree on a sunny day."], "COCO_val2014_000000481635.jpg": ["A lone public bench under a tree surrounded by other trees and grass.  "], "COCO_val2014_000000206027.jpg": ["A green slated park bench under a tree."], "COCO_val2014_000000078915.jpg": ["A green painted bench sitting underneath a tree."], "COCO_val2014_000000551215.jpg": [" a bench sitting in the grass facing the water and boats "], "COCO_val2014_000000261757.jpg": ["A wooden bench overlooking a harbor beneath a cloudy sky."], "COCO_val2014_000000538859.jpg": ["A beach has a grassy area with a park beach."], "COCO_val2014_000000183803.jpg": ["A bench that is sitting in the grass."], "COCO_val2014_000000143975.jpg": ["A bench at the beach next to the sea"], "COCO_val2014_000000490923.jpg": ["a giraffe walking through trees on a sunny day"], "COCO_val2014_000000544519.jpg": ["Giraffe grazing on leaves from tree in native area."], "COCO_val2014_000000096493.jpg": ["A giraffe is walking slowly on the grass as other giraffes walk ahead in a park."], "COCO_val2014_000000336182.jpg": ["The giraffe is looking for a place to eat."], "COCO_val2014_000000371250.jpg": ["A tall giraffe eating leaves off a tree"], "COCO_val2014_000000391735.jpg": ["a view of an air plane wing in the air "], "COCO_val2014_000000008418.jpg": ["Is this the inside of a building for skateboarding?"], "COCO_val2014_000000071466.jpg": ["A yellow airplane wing pointed toward the ground?"], "COCO_val2014_000000065244.jpg": ["An ariel view of a planet in space is shown."], "COCO_val2014_000000080172.jpg": ["landscape photo with plane wing at top and view of sandy hills showing rain gulleys"], "COCO_val2014_000000209868.jpg": ["The snow covered mountain looks over the small city."], "COCO_val2014_000000201723.jpg": ["A COMMERCIAL AIRPLANE FLYING ABOVE THE CITY AND MOUNTAIN"], "COCO_val2014_000000187743.jpg": ["The airplane has taken off from the airport. "], "COCO_val2014_000000023899.jpg": ["A plane ascends over a city, with mountains in the background."], "COCO_val2014_000000150675.jpg": ["a passenger jet plane beginning its ascent over a city in the mountains"], "COCO_val2014_000000362373.jpg": ["A motorcycle sits parked across from a herd of livestock."], "COCO_val2014_000000506552.jpg": ["A motorbike, people and sheep in the background"], "COCO_val2014_000000129576.jpg": ["A motorcycle parked on top of a sandy beach."], "COCO_val2014_000000461898.jpg": ["A motorcycle in the foreground parked in a dirt parking lot"], "COCO_val2014_000000409251.jpg": ["A multicolored motorcycle rests outside of a sheep farm."], "COCO_val2014_000000451468.jpg": ["a flock of goats and some men watching them"], "COCO_val2014_000000340175.jpg": ["a man and a large herd of goats in a desert setting."], "COCO_val2014_000000065267.jpg": ["The nomadic sheepherd walks behind a large group of livestock in their desert habitat."], "COCO_val2014_000000146627.jpg": ["A man is herding his goats is the desert"], "COCO_val2014_000000578498.jpg": ["Men keep watch on a herd of goats."], "COCO_val2014_000000203849.jpg": ["A large group of sheep in a grassy field."], "COCO_val2014_000000196311.jpg": ["many different animals in a large field of green grass "], "COCO_val2014_000000395405.jpg": ["A lot of animals that are in the grass."], "COCO_val2014_000000436470.jpg": ["Sheep are grazing on a bright green field."], "COCO_val2014_000000102446.jpg": ["THERE ARE A LOT OF SHEEPS ON THE GRASS EATING"], "COCO_val2014_000000132001.jpg": ["A giraffe with a mouth full of grass in front of a forest."], "COCO_val2014_000000578500.jpg": ["A close up of a giraffe chewing on some hay."], "COCO_val2014_000000349737.jpg": ["a close up of a giraffe head eating on grass"], "COCO_val2014_000000235597.jpg": ["A giraffe is chewing a mouthful of grass."], "COCO_val2014_000000358763.jpg": ["A hungry giraffe is eating it's food in the zoo."], "COCO_val2014_000000366141.jpg": ["A giraffe standing in the grass near a tree."], "COCO_val2014_000000484982.jpg": ["a brown and white giraffe in a field of grass"], "COCO_val2014_000000057597.jpg": ["a close up of a giraffe with a blurry background "], "COCO_val2014_000000559842.jpg": ["A giraffe stands alone near a rocky hill."], "COCO_val2014_000000129739.jpg": ["A giraffe standing in a picture with a field in back."], "COCO_val2014_000000281878.jpg": ["A building shines in the clear sky as cars drive underneath."], "COCO_val2014_000000503311.jpg": ["A street scene at an intersection with tall skyscrapers in the background. "], "COCO_val2014_000000245453.jpg": ["Large glass building shining from sunlight on it. "], "COCO_val2014_000000568101.jpg": ["A CITY WITH SKY SCRAPERS AND CARS ON IT "], "COCO_val2014_000000049559.jpg": ["Large modern buildings on a busy street. "], "COCO_val2014_000000381106.jpg": ["Several cars are parked in front of a building."], "COCO_val2014_000000132686.jpg": ["A green car has parked on the curb in a parking lot"], "COCO_val2014_000000471009.jpg": ["Small parking lot of cars in front of a stone building."], "COCO_val2014_000000434230.jpg": ["Cars are parked on the the street in front of the building."], "COCO_val2014_000000138477.jpg": ["Cars are parked on the street near an old building."], "COCO_val2014_000000012543.jpg": ["A large white dog is sitting on a bench beside an elderly man."], "COCO_val2014_000000039760.jpg": ["A large white dog sits on a bench with people next to a path."], "COCO_val2014_000000076292.jpg": ["A large dog sits just his bottom on a park bench."], "COCO_val2014_000000499940.jpg": ["A dog sitting on a bench next to an old man."], "COCO_val2014_000000016356.jpg": ["A couple of people sitting on a bench next to a dog."], "COCO_val2014_000000296098.jpg": ["a woman is on a poster hanging outside"], "COCO_val2014_000000146738.jpg": ["A sign in a median is displaying an ad of a woman."], "COCO_val2014_000000428454.jpg": ["A city sidewalk billboard featuring a young woman."], "COCO_val2014_000000400538.jpg": ["A billboard on the median of an intersection."], "COCO_val2014_000000331162.jpg": ["City art installation showing a picture of a girl."], "COCO_val2014_000000502090.jpg": ["A yellow bus is parked near people on the side of the road."], "COCO_val2014_000000137003.jpg": ["A yellow bus stopping at a bus stop in a city."], "COCO_val2014_000000399462.jpg": ["A bus stopped at a bus stop while passengers get on and off."], "COCO_val2014_000000403065.jpg": ["A group of people at a bus stop boarding the bus."], "COCO_val2014_000000232309.jpg": ["It doesn't appear that anyone is waiting on the bus."], "COCO_val2014_000000199602.jpg": ["A political candidate advertisement on the side of a coach bus."], "COCO_val2014_000000028655.jpg": ["Here is Massachusettes candidate Scott Brown's campaign trailer."], "COCO_val2014_000000387431.jpg": ["a large bus with a political ad on the side of it"], "COCO_val2014_000000261061.jpg": ["A tour bus with advertisement on the side of it"], "COCO_val2014_000000168330.jpg": ["a large campaign trailer parked in a parking lot."], "COCO_val2014_000000448269.jpg": ["A bus traveling down a curvy road behind a black car."], "COCO_val2014_000000237669.jpg": ["A group of people cross the curved street."], "COCO_val2014_000000426523.jpg": ["A curve in a city road with a bus following a car and people walking on the side."], "COCO_val2014_000000466211.jpg": ["A group of people walk alongside the road."], "COCO_val2014_000000383384.jpg": ["A fish eye view of a bus rounding a curve on a city street."], "COCO_val2014_000000191096.jpg": ["A lone giraffe walking in an open field."], "COCO_val2014_000000078707.jpg": ["A giraffe stands in the grass in Africa. "], "COCO_val2014_000000336493.jpg": ["A giraffe stands in the field as the sun goes down."], "COCO_val2014_000000342006.jpg": ["A tall giraffe standing in a lush green field."], "COCO_val2014_000000335833.jpg": ["A giraffe stands in a vast, green expanse while puffy clouds and blue sky fill in the background."], "COCO_val2014_000000048636.jpg": ["Two giraffes standing together in an open field zoo den"], "COCO_val2014_000000132615.jpg": ["One giraffe licks the tree limb while the other looks at him strangely. "], "COCO_val2014_000000430359.jpg": ["Two giraffes lick a branch on a grassy field."], "COCO_val2014_000000113914.jpg": ["There are two giraffes standing next to a tree branch"], "COCO_val2014_000000074369.jpg": ["Head of two giraffes with one slicking the bark on a tree."], "COCO_val2014_000000418949.jpg": ["A couple of traffic lights sitting under a cloudy sky."], "COCO_val2014_000000569768.jpg": ["a street light has the red lights glowing"], "COCO_val2014_000000505099.jpg": ["The traffic lights are clearly visible for all of us to see. "], "COCO_val2014_000000384012.jpg": ["a pole with a stop lights attached to it"], "COCO_val2014_000000093725.jpg": ["two sets of street lights attached to a pole "], "COCO_val2014_000000579056.jpg": ["A giraffe drinking water from a  river on a beach."], "COCO_val2014_000000217285.jpg": ["A lone giraffe that is getting a drink of water from a small pond."], "COCO_val2014_000000276580.jpg": ["A giraffe awkwardly sips water from a puddle in the dirt road."], "COCO_val2014_000000377715.jpg": ["Giraffe is eating or drinking something off of the ground."], "COCO_val2014_000000351683.jpg": ["A giraffe leaning down and bending its knees to drink from a puddle"], "COCO_val2014_000000005064.jpg": ["A group of giraffes standing near each other. "], "COCO_val2014_000000046859.jpg": ["a small herd of giraffe in an open field"], "COCO_val2014_000000024223.jpg": ["All of the tall giraffes are standing in the grass."], "COCO_val2014_000000365426.jpg": ["A bunch of giraffes that are standing in the grass."], "COCO_val2014_000000564745.jpg": ["Several giraffes standing near rocks in front of trees."], "COCO_val2014_000000069392.jpg": ["Two giraffe standing next to each other on a grassy field."], "COCO_val2014_000000240727.jpg": ["Two giraffes stroll past each other near a bush."], "COCO_val2014_000000236412.jpg": ["Two giraffes standing near trees in a grassy area. "], "COCO_val2014_000000020965.jpg": ["Two giraffes rub their necks together as they stand by the trees in the sunlight. "], "COCO_val2014_000000360926.jpg": ["Two giraffes crossing paths on a green and grassy field."], "COCO_val2014_000000303298.jpg": ["A giraffe lying on the ground in a zoo pin."], "COCO_val2014_000000158015.jpg": ["A giraffe laying down on the dirt ground. "], "COCO_val2014_000000280607.jpg": ["Lone giraffe lying in dirt area of enclosure."], "COCO_val2014_000000340420.jpg": ["Small giraffe sitting on the ground while the sun hits its body."], "COCO_val2014_000000477010.jpg": ["A giraffe laying down on top of a dirt field."], "COCO_val2014_000000560323.jpg": ["a couple of giraffes that are walking around"], "COCO_val2014_000000308441.jpg": ["A herd of giraffe standing on top of a dirt field."], "COCO_val2014_000000480726.jpg": ["Several smaller giraffes that are in an enclosure."], "COCO_val2014_000000527023.jpg": ["The giraffes are walking in different directions outside."], "COCO_val2014_000000493174.jpg": ["A giraffe standing next to three baby giraffes in a zoo exhibit."], "COCO_val2014_000000331692.jpg": ["some street signs sitting on a pole next to a street light "], "COCO_val2014_000000284220.jpg": ["A traffic light and road signs are posted near buildings."], "COCO_val2014_000000272262.jpg": ["A traffic light and a sign for the entrance of highway 527 South."], "COCO_val2014_000000196053.jpg": ["A streetlight next to a street sign and a directional sign."], "COCO_val2014_000000461063.jpg": ["a green light is next to a couple of street signs on a pole"], "COCO_val2014_000000133698.jpg": ["A street light with many signs on it stands to the foreground of a large building standing beside a naked tree.  "], "COCO_val2014_000000335578.jpg": ["A stoplight with street signs on it "], "COCO_val2014_000000377385.jpg": ["A pole has street signs and traffic lights on it."], "COCO_val2014_000000500062.jpg": ["The traffic and walk signals are at C and 3 Streets"], "COCO_val2014_000000398362.jpg": ["There is an image of an outdoor area. \n\n"], "COCO_val2014_000000152751.jpg": ["A bench with potted plants sitting on top of it. "], "COCO_val2014_000000038034.jpg": ["A bench surrounded by different plants on ground and potted plants."], "COCO_val2014_000000212704.jpg": ["An empty red bench in an overgrown garden."], "COCO_val2014_000000295564.jpg": ["A bench is in an overgrown yard by a hose."], "COCO_val2014_000000524456.jpg": ["There is a metal and wood chair in a garden"], "COCO_val2014_000000354540.jpg": ["A large giraffe is standing in the wilderness."], "COCO_val2014_000000041550.jpg": ["A giraffe stands in an area with many tall trees"], "COCO_val2014_000000043635.jpg": ["A giraffe standing in a field full of trees and plants."], "COCO_val2014_000000153563.jpg": ["A large giraffe is standing outdoors near some trees. "], "COCO_val2014_000000335532.jpg": ["A large tall giraffe standing by a tree."], "COCO_val2014_000000365289.jpg": ["A yellow school bus with a creepy eye shaped rear view mirror."], "COCO_val2014_000000010766.jpg": ["The mirrors of a yellow school bus below a cloudy sky."], "COCO_val2014_000000209604.jpg": ["The school bus features a safety mirror on the side."], "COCO_val2014_000000289610.jpg": ["a close up of the front end of a school bus "], "COCO_val2014_000000521967.jpg": ["A school bus with a front mirror next to a light pole."], "COCO_val2014_000000027235.jpg": ["An eating area with a table and a few chairs."], "COCO_val2014_000000153343.jpg": ["Table situated in corner of room with a vase for a center piece"], "COCO_val2014_000000299716.jpg": ["A wooden table sitting below a bunch of windows."], "COCO_val2014_000000294119.jpg": ["A dining room table next to windows overlooking woods"], "COCO_val2014_000000348654.jpg": ["A wooden dining table is surrounded by windows."], "COCO_val2014_000000095786.jpg": ["Two buses parked in a parking lot next to cars."], "COCO_val2014_000000189845.jpg": ["People crossing a busy city street full of vehicles."], "COCO_val2014_000000534957.jpg": ["A couple of people are crossing a busy street"], "COCO_val2014_000000101622.jpg": ["Pedestrians crossing a street between buses and cars. "], "COCO_val2014_000000320039.jpg": ["A street with two busses and people walking."], "COCO_val2014_000000421010.jpg": ["A large point tower towering over a traffic light."], "COCO_val2014_000000376959.jpg": ["a stop light that is out on a pole"], "COCO_val2014_000000137658.jpg": ["Street signal light near church at dusk near streetlight."], "COCO_val2014_000000087199.jpg": ["A view of a stop light, with a cathedral, in the back."], "COCO_val2014_000000410337.jpg": ["Traffic signals direct traffic while a tower is in the background."], "COCO_val2014_000000057545.jpg": ["Close up of a traffic light with three lights, the top illuminated red with a person image, the second down not illuminated, and the bottom on hanging down."], "COCO_val2014_000000562870.jpg": ["there are three different lights that show if u can walk"], "COCO_val2014_000000326541.jpg": ["A traffic light with it's green light busted."], "COCO_val2014_000000162952.jpg": ["A traffic signal has a pedestrian walk symbol alight.   "], "COCO_val2014_000000573206.jpg": ["A stoplight on a pole near a large building "], "COCO_val2014_000000213086.jpg": ["A woman in sunglasses is in a picture with a giraffe. "], "COCO_val2014_000000191270.jpg": ["A woman wearing sun glasses standing next to a giraffe."], "COCO_val2014_000000169891.jpg": ["a woman smiles as a giraffe walks in the back ground "], "COCO_val2014_000000503772.jpg": ["a lady with glasses with a giraffe behind her"], "COCO_val2014_000000180490.jpg": ["The woman is taking a picture of herself and the giraffe. "], "COCO_val2014_000000385633.jpg": ["A bus parked next to another bus at a bus stop."], "COCO_val2014_000000310325.jpg": ["People getting on a bus at a station."], "COCO_val2014_000000053542.jpg": ["People boarding a commuter bus on a sunny day"], "COCO_val2014_000000231339.jpg": ["A busy city bus stop with people boarding the buses."], "COCO_val2014_000000058915.jpg": ["A white bus is parked at a station where people are waiting."], "COCO_val2014_000000356302.jpg": ["A line of multiple buses parked along a wall."], "COCO_val2014_000000082327.jpg": ["A long line of buses pass on an urban street. "], "COCO_val2014_000000331807.jpg": ["A caravan of buses are parked on the side of the road."], "COCO_val2014_000000453756.jpg": ["A very long row of buses on the street in a city."], "COCO_val2014_000000153607.jpg": ["Several city buses lined up in a large city."], "COCO_val2014_000000477949.jpg": ["A couple of giraffes that are standing in the grass."], "COCO_val2014_000000300138.jpg": ["two giraffes in a field near many trees"], "COCO_val2014_000000527025.jpg": ["Two giraffes are grazing side by side, but in opposite directions."], "COCO_val2014_000000576939.jpg": ["Two giraffes are facing in opposite directions with their necks bent down.  "], "COCO_val2014_000000527248.jpg": ["A couple of giraffe standing next to each other."], "COCO_val2014_000000508730.jpg": ["A park bench submerged in water in a flood."], "COCO_val2014_000000039743.jpg": ["An orange bench surrounded by flood waters near a small metal grill."], "COCO_val2014_000000353136.jpg": ["A bench under water in a park that has been flooded "], "COCO_val2014_000000083915.jpg": ["The water of the river is muddy brown."], "COCO_val2014_000000129159.jpg": ["A red park bench sitting in the middle of a flooded area."], "COCO_val2014_000000529636.jpg": ["A woman sitting on a bench reading a paper."], "COCO_val2014_000000457691.jpg": ["A man and a women sitting on a bench, the women is reading a newspaper."], "COCO_val2014_000000014941.jpg": ["A young woman sitting on the bench of a pier reading the newspaper"], "COCO_val2014_000000371999.jpg": ["A lady reading a newspaper on a public bench outside."], "COCO_val2014_000000002240.jpg": ["two people sitting on a bench with a boat in the background"], "COCO_val2014_000000003084.jpg": ["A giraffe standing next to a covered structure."], "COCO_val2014_000000142592.jpg": ["A giraffe reaching up to greet someone with food"], "COCO_val2014_000000577821.jpg": ["A giraffe extends his neck near an onlooker."], "COCO_val2014_000000028377.jpg": ["People are feeding a giraffe at the zoo."], "COCO_val2014_000000239448.jpg": ["Giraffe approaches a person and almost touches person hand."], "COCO_val2014_000000558524.jpg": ["People are waiting on a corner to cross a street. "], "COCO_val2014_000000550426.jpg": ["A man speaking to a crowd of people waiting to cross the street."], "COCO_val2014_000000222304.jpg": ["A large group of people on a corner waiting to cross the street."]}